c5n/oh-ez-touch/sdkconfig.defaults.esp32
# ESP32 device settings.

CONFIG_IDF_TARGET="esp32"
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_FLASHMODE_DIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

# LV_DEF_REFR_PERIOD is 30 ms, so a 100 Hz tick (the IDF default) quantises the
# refresh badly.
CONFIG_FREERTOS_HZ=1000

CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
